[
  {
    "id": "1",
    "position": "Software Engineer Internship",
    "period": "May 2023 - Aug 2023",
    "org": "MatrixCare, Inc.",
    "location": "Minnesota, United States",
    "description": [
      "Reduced the access time of customer identity provider information across all product verticals from months to days through a real-time metrics dashboard using React, TypeScript and Next.js.",
      "Ensured the dashboard functionalities were in alignment with the technical specifications through rapid iteration, collaboration and continuous deployment with Azure DevOps and Kubernetes.",
      "Optimized page response and load times by 30% leveraging server components and server-side rendering."]
  },
  {
    "id": "2",
    "position": "Software Research Internship",
    "period": "Feb 2023 - Apr 2023",
    "org": "NASA Colorado Space Grant Consortium",
    "location": "Boulder, United States",
    "description": [
      "Enabled communication between several custom Arduino Atmega328 microcontrollers to exchange lunar surface temperature and material composition data by implementing an RF subsystem utilizing SPI and I2C protocols.",
      "Researched and implemented efficient error detection and correction techniques in C++, that minimized the transmission time and memory usage, thereby enhancing the reliability of the transmitted packets."
    ]
  },
  {
    "id": "3",
    "position": "Full Stack Software Engineer",
    "period": "June 2019 - June 2022",
    "org": "Vassar Labs",
    "location": "Hyderabad, India",
    "description": [
      "Streamlined the supply chain operations of a leading US manufacturing firm by interfacing Angular UI components with a smart artificial intelligence powered platform. It reduced the order escalations leading to a 20% increase in operational efficiency.",
      "Led a team of five people in revamping the legacy Identity and Access Management (IAM) system with custom Keycloak flows, OTP integration, captcha support, and two-factor authentication, leading to a 15% uptick in user engagement.",
      "Designed and developed a table library using Angular that supported sorting, filtering, pagination, and reordering of rows and columns. It promoted code reusability and reduced future development efforts across all projects by 40%.",
      "Provided granular access control for a single customer to manage users across multiple products through custom authorization rules and implementation of business services with Spring Boot and Angular."
    ]
  }
]